In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
data=pd.read_csv("HYD123.csv")

In [28]:
data.head()

   Area     Location  No. of Bedrooms  Resale
0  1340     Nizampet                2       0
1  3498  Hitech City                4       0
2  1318    Manikonda                2       0
3  1295        Alwal                3       1
4  1145   Kukatpally                2       0

In [29]:
data.tail()

      Area     Location  No. of Bedrooms  Resale
2513  1460     Nacharam                2       1
2514  1314    Manikonda                2       1
2515  2625     Madhapur                3       1
2516  2050  Hitech City                3       0
2517  1805     Narsingi                3       0

In [30]:
data.shape

(2518, 4)

In [31]:
data.describe()

              Area  No. of Bedrooms       Resale
count  2518.000000      2518.000000  2518.000000
mean   1644.571088         2.623511     0.227562
std     746.256956         0.687330     0.419341
min     500.000000         1.000000     0.000000
25%    1160.000000         2.000000     0.000000
50%    1500.000000         3.000000     0.000000
75%    1829.000000         3.000000     0.000000
max    9400.000000         8.000000     1.000000

In [32]:
data.isnull().sum()

Area               0
Location           0
No. of Bedrooms    0
Resale             0
dtype: int64

In [33]:
duplicate_rows = data[data.duplicated()].index
duplicate_data = data.loc[duplicate_rows]

print("duplicate_rows:")
print(duplicate_rows)
print("duplicate_data:")
print(duplicate_data)

duplicate_rows:
Int64Index([  18,   20,   21,   22,   23,   24,   25,   26,   27,   28,
            ...
            2481, 2482, 2483, 2486, 2489, 2495, 2502, 2504, 2514, 2515],
           dtype='int64', length=1034)
duplicate_data:
      Area     Location  No. of Bedrooms  Resale
18    2240     Tellapur                3       0
20    1340     Nizampet                2       0
21    3498  Hitech City                4       0
22    1318    Manikonda                2       0
23    1295        Alwal                3       1
...    ...          ...              ...     ...
2495  1250   Nallakunta                3       1
2502  1050     Nacharam                2       0
2504  1000     Nacharam                2       1
2514  1314    Manikonda                2       1
2515  2625     Madhapur                3       1

[1034 rows x 4 columns]

In [34]:

"""**3.FEATURE ENGINEERING**"""

unique_locations = data['Location'].unique()

print("Unique values in the 'location' column:")
print(unique_locations)

# Find the frequency of each value in the 'location' column
location_frequency = data['Location'].value_counts()

print("Frequency of each value in the 'location' column:")
print(location_frequency)

top_20_locations = data['Location'].value_counts().nlargest(20).index

top_20_locations

Unique values in the 'location' column:
['Nizampet' 'Hitech City' 'Manikonda' 'Alwal' 'Kukatpally' 'Gachibowli'
 'Tellapur' 'Kokapet' 'Hyder Nagar' 'Mehdipatnam' 'Narsingi'
 'Khajaguda Nanakramguda Road' 'Madhapur' 'Puppalaguda' 'Begumpet'
 'Banjara Hills' 'AS Rao Nagar' 'Pragathi Nagar Kukatpally' 'Miyapur'
 'Mallampet' 'Nanakramguda' 'Attapur' 'West Marredpally' 'Kompally'
 'Sri Nagar Colony' 'Hakimpet' 'Pocharam' 'Nagole' 'LB Nagar' 'Meerpet'
 'Kachiguda' 'Masab Tank' 'Kondapur' 'Saroornagar' 'Uppal Kalan'
 'Mallapur' 'Rajendra Nagar' 'Beeramguda' 'Moosapet' 'Bachupally'
 'Toli Chowki' 'Lakdikapul' 'Tarnaka' 'Kistareddypet' 'Hafeezpet'
 'Shaikpet' 'Amberpet' 'Kapra' 'Trimalgherry' 'Habsiguda' 'Sanath Nagar'
 'Darga Khaliz Khan' 'Kothaguda' 'Balanagar' 'Jubilee Hills' 'raidurgam'
 'Murad Nagar' 'Chandanagar' 'East Marredpally' 'Aminpur' 'Gajularamaram'
 'Serilingampally' 'Malkajgiri' 'Mettuguda' 'Venkat Nagar Colony'
 'Kondakal' 'Gopanpally' 'Somajiguda' 'Nallagandla Gachibowli'
 'Krishna Reddy Pet' 'Bolarum' 'Zamistanpur' 'Madhura Nagar'
 'Ghansi Bazaar' 'Chintalakunta' 'Chinthal Basthi' 'Nallakunta'
 'Bowenpally' 'Bandlaguda Jagir' 'Boduppal' 'Neknampur'
 'Appa Junction Peerancheru' 'Ambedkar Nagar' 'Vanasthalipuram'
 'Moula Ali' 'Gandipet' 'Nacharam' 'Appa Junction' 'Qutub Shahi Tombs'
 'Abids' 'Dilsukh Nagar' 'Quthbullapur' 'Sainikpuri' 'KTR Colony'
 'Bollaram' 'Karmanghat' 'Gajulramaram Kukatpally' 'Uppal' 'Cherlapalli'
 'Himayat Nagar' 'Rhoda Mistri Nagar' 'Chintalmet' 'Hitex Road' 'ECIL'
 'Boiguda' 'ECIL Main Road' 'ECIL Cross Road' 'Rajbhavan Road Somajiguda'
 'Ramachandra Puram' 'TellapurOsman Nagar Road' 'Mansoorabad'
 'KRCR Colony Road' 'Pragati Nagar' 'Padmarao Nagar'
 'Paramount Colony Toli Chowki' 'BK Guda Internal Road' 'muthangi'
 'Pragathi Nagar' 'Yapral' 'Narayanguda' 'Kollur' 'Bachupally Road'
 'Old Bowenpally' 'Alapathi Nagar' 'Arvind Nagar Colony' 'Matrusri Nagar'
 'Pragathi Nagar Road' 'Padma Colony' 'Happy Homes Colony'
 'Old Nallakunta' 'Sangeet Nagar' 'NRSA Colony' 'Adibatla'
 'Methodist Colony' 'Ameerpet' 'ALIND Employees Colony' 'Khizra Enclave'
 'Medchal' 'Dammaiguda' 'Suchitra' 'Whitefields' 'Mayuri Nagar'
 'Adda Gutta' 'Miyapur HMT Swarnapuri Colony'
 'Central Excise Colony Hyderabad' 'Basheer Bagh' 'Gopal Nagar'
 'Bachupaly Road Miyapur' 'Kushaiguda' 'Ashok Nagar' 'Barkatpura'
 'Madinaguda' 'Bagh Amberpet' 'new nallakunta' 'BHEL' 'Sun City'
 'Hydershakote' 'BK Guda Road' 'Nallagandla Road' 'IDPL Colony'
 'Ramnagar Gundu' 'Alkapur township' 'Banjara Hills Road Number 12'
 'Panchavati Colony Manikonda' 'New Maruthi Nagar'
 'Madhavaram Nagar Colony' 'Miyapur Bachupally Road' 'nizampet road'
 'Kokapeta Village' 'HMT Hills' 'Tilak Nagar' 'Chititra Medchal' 'Isnapur'
 'D D Colony' 'DD Colony' 'Patancheru Shankarpalli Road' 'Patancheru'
 'Jhangir Pet' 'Almasguda' 'Allwyn Colony' 'financial District'
 'Beeramguda Road' 'Pati' 'Karimnagar' 'Kollur Road'
 'Sun City Padmasri Estates' 'Chaitanyapuri' 'Nandagiri Hills'
 'Whitefield' 'Film Nagar' 'Kismatpur' 'Dr A S Rao Nagar Rd' 'Dullapally'
 'KPHB' 'Vivekananda Nagar Colony' 'Ameenpur' 'Chintradripet' 'Ring Road'
 'Saket' 'Kavuri Hills' 'manneguda' 'Moti Nagar' 'Usman Nagar' 'Shadnagar'
 'Bongloor' 'Mailardevpally' 'Uppalguda' 'Tirumalgiri' 'Chikkadapally'
 'JNTU' 'hyderabad' 'Shamshabad' 'Srisailam Highway' 'Domalguda'
 'Lingampalli' 'Residential Flat Machavaram' 'Whisper Valley'
 'Tukkuguda Airport View Point Road' 'Santoshnagar' 'Tolichowki'
 'Domalguda Road' 'Shankarpalli' 'Kothapet' 'Baghlingampally' 'Picket'
 'Safilguda' 'Sikh Village' 'Neredmet' 'Macha Bolarum' 'Kowkur'
 'Rakshapuram' 'west venkatapuram' 'Vidyanagar Adikmet' 'Aushapur'
 'Old Alwal' 'Secunderabad Railway Station Road' 'Balapur' 'Hastinapur'
 'chandrayangutta' 'Balaji Hills Colony Venkatraya Nagar'
 'Janachaitanya Colony' 'Gurramguda' 'Paradise Circle']
Frequency of each value in the 'location' column:
Kukatpally                       166
Kondapur                         149
Manikonda                        115
Nizampet                         106
Gachibowli                        83
                                ...
Basheer Bagh                       1
Miyapur HMT Swarnapuri Colony      1
Adda Gutta                         1
Mayuri Nagar                       1
Paradise Circle                    1
Name: Location, Length: 243, dtype: int64

Index(['Kukatpally', 'Kondapur', 'Manikonda', 'Nizampet', 'Gachibowli',
       'Hitech City', 'Miyapur', 'Kokapet', 'Pragathi Nagar Kukatpally',
       'Bachupally Road', 'Narsingi', 'Puppalaguda', 'Beeramguda',
       'Nanakramguda', 'Gajularamaram', 'Banjara Hills', 'Tellapur',
       'Appa Junction', 'Serilingampally', 'Jubilee Hills'],
      dtype='object')

In [35]:
# Identify the top 15 locations
top_20_locations = data['Location'].value_counts().nlargest(20)

# Display the frequency of the top 15 locations
print(top_20_locations)

Kukatpally                   166
Kondapur                     149
Manikonda                    115
Nizampet                     106
Gachibowli                    83
Hitech City                   82
Miyapur                       80
Kokapet                       79
Pragathi Nagar Kukatpally     57
Bachupally Road               55
Narsingi                      52
Puppalaguda                   51
Beeramguda                    51
Nanakramguda                  49
Gajularamaram                 48
Banjara Hills                 44
Tellapur                      43
Appa Junction                 43
Serilingampally               41
Jubilee Hills                 41
Name: Location, dtype: int64

In [36]:
# Assuming 'data_1' is your DataFrame
# Identify the top 10 locations
top_20_locations = data['Location'].value_counts().nlargest(20).index

# Filter the DataFrame to get locations that are not in the top 10
other_locations = data[~data['Location'].isin(top_20_locations)]

# Find the frequency of these other locations
frequency_other_locations = other_locations['Location'].value_counts()

# Display the frequency of locations other than the top 10 locations
print(frequency_other_locations)

Madhapur                     34
Krishna Reddy Pet            34
Nallagandla Gachibowli       32
Bachupally                   28
Appa Junction Peerancheru    28
                             ..
Khizra Enclave                1
ALIND Employees Colony        1
Ameerpet                      1
Methodist Colony              1
Paradise Circle               1
Name: Location, Length: 223, dtype: int64

In [37]:
import random

top_20_locations = ['Kukatpally', 'Kondapur', 'Manikonda', 'Nizampet', 'Gachibowli',
       'Hitech City', 'Miyapur', 'Kokapet', 'Pragathi Nagar Kukatpally',
       'Bachupally Road', 'Narsingi', 'Puppalaguda', 'Beeramguda',
       'Nanakramguda', 'Gajularamaram', 'Banjara Hills', 'Tellapur',
       'Appa Junction', 'Serilingampally', 'Jubilee Hills']

# Fill the 'Location' column with random choices from the top 10 locations
data['Location'] = pd.Series([random.choice(top_20_locations) for _ in data.index], index=data.index)

# Display the first few rows to check
print(data.head(10))

   Area         Location  No. of Bedrooms  Resale
0  1340        Manikonda                2       0
1  3498         Kondapur                4       0
2  1318         Nizampet                2       0
3  1295    Appa Junction                3       1
4  1145        Manikonda                2       0
5  1230    Jubilee Hills                2       0
6  1350  Bachupally Road                2       0
7  1400         Kondapur                3       0
8  2240      Puppalaguda                3       0
9  1520        Manikonda                2       1

In [38]:
"""**2**.**DATA** **TRANSFORMATION**"""

# Import the LabelEncoder class from the sklearn.preprocessing module
from sklearn.preprocessing import LabelEncoder

# Create an instance of the LabelEncoder class
encoder = LabelEncoder()

# Fit the encoder to the "Location" column and transform the data
data = data.copy()  # Ensure data_1 is a copy if needed
data.loc[:, "location_encoded"] = encoder.fit_transform(data.loc[:, "Location"].astype(str))

data.shape

data["location_encoded"].head(10)

0    11
1     9
2    15
3     0
4    11
5     7
6     1
7     9
8    17
9    11
Name: location_encoded, dtype: int32

In [39]:
data.head(10)

   Area         Location  No. of Bedrooms  Resale  location_encoded
0  1340        Manikonda                2       0                11
1  3498         Kondapur                4       0                 9
2  1318         Nizampet                2       0                15
3  1295    Appa Junction                3       1                 0
4  1145        Manikonda                2       0                11
5  1230    Jubilee Hills                2       0                 7
6  1350  Bachupally Road                2       0                 1
7  1400         Kondapur                3       0                 9
8  2240      Puppalaguda                3       0                17
9  1520        Manikonda                2       1                11

In [40]:
# Find the frequency of each value in the 'location' column
location_frequency = data['Location'].value_counts()

print("Frequency of each value in the 'location' column:")
print(location_frequency)

Frequency of each value in the 'location' column:
Kondapur                     148
Jubilee Hills                146
Beeramguda                   134
Manikonda                    133
Narsingi                     133
Puppalaguda                  131
Nanakramguda                 130
Serilingampally              130
Nizampet                     129
Appa Junction                128
Kokapet                      127
Hitech City                  123
Kukatpally                   121
Gachibowli                   120
Miyapur                      119
Bachupally Road              115
Pragathi Nagar Kukatpally    115
Banjara Hills                113
Tellapur                     112
Gajularamaram                111
Name: Location, dtype: int64